testing/simpleFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletlarge
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }

    pipewall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inletsmall
    {
        type            fixedValue;
        value           uniform (0 1 0);
    }
 pressureoutlet
    {
        type            zeroGradient;
    }
 symmetry1
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
