testing/simpleFoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

 FoamFile
 {
     version     2.0;
     format      ascii;
     class       dictionary;
     location    "constant";
     object      transportProperties;
 }
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
 transportModel  Newtonian;
 
 // ro = 1 kg/m3
 // mu = 2e-3 kg/m/s
 
 nu              nu [ 0 2 -1 0 0 0 0 ] 1e-4;
 

 
 
 // ************************************************************************* //
