testing/simpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.
 FoamFile
 {
     version     2.0;
     format      ascii;
     class       dictionary;
     location    "system";
     object      controlDict;
 }
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
 application     simpleFoam;
 
 startFrom       startTime;
 
 startTime       0;
 
 stopAt          endTime;
 
 endTime         1000;
 
 deltaT          1;
 
 writeControl    timeStep;
 
 writeInterval   100;
 
 purgeWrite      0;
 
 writeFormat     ascii;
 
 writePrecision  6;
 
 writeCompression compressed;
 
 timeFormat      general;
 
 timePrecision   6;
 
 runTimeModifiable yes;
   // ************************************************************************* //
